-- 2.(1) 采油一矿二队2018-5-1到2018-5-28有哪些项目完成了预算，列出相应明细。
SELECT
	[单据号],[预算单位],[井号],[预算金额],[预算人],[预算日期] 
FROM
	[作业项目表] 
WHERE
	[预算日期] BETWEEN '2018-5-1' AND '2018-5-28' 
	AND [预算单位]= '112201002';
	
-- 2.(2) 采油一矿二队2018-5-1到2018-5-28有哪些项目完成了结算，列出相应明细。
SELECT
	[单据号],[井号],[结算金额],[结算人],[结算日期]
FROM
	[作业项目表]
WHERE
	[结算日期] BETWEEN '2018-5-1' AND '2018-5-28'
	AND [预算单位] = '112201002';
	
-- 2.(3) 采油一矿二队2018-5-1到2018-5-28有哪些项目完成了结算，列出相应的材料费消耗明细。
SELECT *
FROM 
	[材料消耗明细表]
WHERE
	[单据号] 
	IN
	(SELECT [单据号]
	FROM
		[作业项目表]
	WHERE 
		[结算日期] BETWEEN '2018-5-1' AND '2018-5-28'
		AND [预算单位] = '112201002');
	
-- 2.(4)采油一矿二队2018-5-1到2018-5-28有哪些项目完成了入账，列出相应明细
SELECT
	[单据号],[井号],[入账金额],[入账人],[入账日期]
FROM
	[作业项目表]
WHERE
	[入账日期] BETWEEN '2018-5-1' AND '2018-5-28'
	AND [预算单位] = '112201002';
	
-- 2.(5)列出采油一矿二队2018-5-1到2018-5-28总的预算金额。
SELECT
	SUM([预算金额]) AS 一矿二队总预算金额
FROM
	[作业项目表]
	WHERE
	[预算日期] BETWEEN '2018-5-1' AND '2018-5-28'
	AND [预算单位] = '112201002';

-- 2.(6)列出采油一矿二队2018-5-1到2018-5-28总的结算金额。
SELECT
	SUM([结算金额]) AS 一矿二队总结算金额
FROM
	[作业项目表]
	WHERE
	[结算日期] BETWEEN '2018-5-1' AND '2018-5-28'
	AND [预算单位] = '112201002';
	
-- 2.(7)列出采油一矿二队2018-5-1到2018-5-28总的入账金额。
SELECT
	SUM([入账金额]) AS 一矿二队总入账金额
FROM
	[作业项目表]
	WHERE
	[入账日期] BETWEEN '2018-5-1' AND '2018-5-28'
	AND [预算单位] = '112201002';
	
-- 2.(8)列出采油一矿2018-5-1到2018-5-28总的入账金额。
SELECT
	SUM([入账金额]) AS 采油一矿总入账金额
FROM
	[作业项目表]
	WHERE
	[入账日期] BETWEEN '2018-5-1' AND '2018-5-28'
	AND [预算单位] LIKE '112201___';

-- 2.(9)有哪些人员参与了入账操作。
SELECT DISTINCT
	[入账人]
FROM
	[作业项目表]
	WHERE
	[入账人] <> '';

-- 2.(10)列出2018-5-1到2018-5-28进行了结算但未入账的项目。
SELECT
	[单据号]
FROM
	[作业项目表]
	WHERE
	[结算日期] BETWEEN '2018-5-1' AND '2018-5-28'
	AND
	[入账日期] NOT BETWEEN '2018-5-1' AND '2018-5-28';

-- 2.(11)列出采油一矿二队的所有项目，按入账金额从高到低排列。
SELECT
	[单据号],[入账金额]
FROM
	[作业项目表]
	WHERE
	[预算单位] = '112201002'
	ORDER BY
	[入账金额] DESC;

-- 2.(12)列出有哪些施工单位实施了项目，并计算各单位所有项目结算金额总和。
SELECT 
	[施工单位], SUM([结算金额]) AS 结算金额总和
FROM
	[作业项目表]
	GROUP BY
	[施工单位];

-- 2.(13)找出消耗了材料三且消耗超过了2000元的项目，列出相应消耗明细(利用子查询)。
SELECT *
FROM
	[材料消耗明细表]
	WHERE 
		[单据号]
	IN
	(SELECT
		[单据号]
	FROM
		[材料消耗明细表]
		WHERE
			[物码] = 'wm003' AND [消耗数量]*[单价] > 2000);
		
-- 2.(14)作业公司二队参与了哪些项目。
SELECT 
	[单据号]
FROM
	[作业项目表]
	WHERE
	[施工单位] = '作业公司作业二队';

-- 2.(15)作业公司一队和二队参与了哪些项目（利用union）。
SELECT 
	[单据号]
FROM
	[作业项目表]
	WHERE
	[施工单位] = '作业公司作业一队'
UNION
SELECT 
	[单据号]
FROM
	[作业项目表]
	WHERE
	[施工单位] = '作业公司作业二队';

-- 2.(16)采油一矿的油井是哪些作业队参与施工的。
SELECT
	[施工单位]
FROM
	[作业项目表]
	WHERE [井号]
	IN
	(SELECT [井号]
	FROM
		[油水井表]
	WHERE
		[井别] = '油井'
		AND
		[单位代码] IN
		(SELECT
		 [单位代码]
		FROM
			[单位代码表]
		WHERE 
			[单位名称]
		LIKE '采油一矿%'));
		