-- 3.(1)建立数据表(包含3个属性列：★施工单位、★年月、◆结算金额)保存各个施工单位每月的结算金额总和。
CREATE TABLE 数据表 (
	施工单位 CHAR(20),
	年月 CHAR(20),
	结算金额 MONEY
);

-- 3.(2)用子查询将各个施工单位每月的结算金额总和插入到所建立的数据表中。
INSERT INTO 数据表(施工单位, 年月, 结算金额)
(SELECT 
	[施工单位], YEAR([结算日期])*100 + MONTH([结算日期]), SUM([结算金额])
 FROM
	[作业项目表]
	GROUP BY
	[施工单位], YEAR([结算日期])*100 + MONTH([结算日期])
 );
 
BEGIN TRANSACTION
-- 修改之前查询
SELECT 单据号, 结算人, 单位名称
FROM 单位代码表, 作业项目表
WHERE 
	[单位代码] = [预算单位] AND [单位名称] IN ('采油一矿一队', '采油一矿二队', '采油一矿三队');

-- 3.(3)用带子查询的修改语句将采油一矿油井作业项目的结算人改为“李兵”。
UPDATE [作业项目表]
SET [结算人] = '李兵'
	WHERE [预算单位] IN
		(SELECT [单位代码]
		FROM [单位代码表]
		WHERE
			[单位代码] = [预算单位] AND [单位名称] IN ('采油一矿一队', '采油一矿二队', '采油一矿三队')
		);

-- 修改之后查询
SELECT 单据号, 结算人, 单位名称
FROM 单位代码表, 作业项目表
WHERE 
	[单位代码] = [预算单位] AND [单位名称] IN ('采油一矿一队', '采油一矿二队', '采油一矿三队');

-- 3.(4)用带子查询的删除语句删除采油一矿油井作业项目。

DELETE FROM [作业项目表]
WHERE [预算单位] IN (
	SELECT [单位代码]
	FROM [单位代码表]
	WHERE 
		[单位代码] = [预算单位] AND [单位名称] IN ('采油一矿一队', '采油一矿二队', '采油一矿三队')
	);

-- 删除之后查询
SELECT 单据号, 结算人, 单位名称
FROM 作业项目表

-- 3.(5)撤消上述两个操作。
ROLLBACK;
