-- 利用Query Analyzer进行如下事务处理练习
--（把下列五条语句作为一个事务处理，只有五条语句全部成功执行才做提交，
-- 并给出成功的提示信息；否则就做回退处理，并给出具体的错误提示信息）：
-- insert into 作业项目表 values('zy2018006','112202002','y005',
-- 10000,'张三', '07-01-2018' ,'07-04-2018','07-25-2018',
-- '作业公司作业一队','堵漏',7000,2500,1000,1400,11900,
-- '李四','07-26-2018',11900,'王五','07-28-2018')
-- insert into 材料费表 values('zy2018006','wm001',200,10)
-- insert into 材料费表 values('zy2018006','wm002',200,10)
-- insert into 材料费表 values('zy2018006','wm003',200,10)
-- insert into 材料费表 values('zy2018006','wm004',100,10)
-- 注：“作业项目表”、“材料费表”根据自己所命名的表名进行相应的替换。

BEGIN TRANSACTION
    GO
    INSERT INTO 作业项目表 VALUES('zy2018006','112202002','y005',
    10000,'张三', '07-01-2018' ,'07-04-2018','07-25-2018',
    '作业公司作业一队','堵漏',7000,2500,1000,1400,11900,
    '李四','07-26-2018',11900,'王五','07-28-2018')
    INSERT INTO 材料消耗明细表 VALUES ('zy2018006','wm001',200,10)
    INSERT INTO 材料消耗明细表 VALUES ('zy2018006','wm002',200,10)
    INSERT INTO 材料消耗明细表 VALUES ('zy2018006','wm003',200,10)
    INSERT INTO 材料消耗明细表 VALUES ('zy2018006','wm004',100,10) 
    IF @@ERROR <> 0
        BEGIN
            print '语句执行失败'
            ROLLBACK
        END
    ELSE
        BEGIN
            print '语句执行成功'
            COMMIT
        END